Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: industry, and too complicated to respond to rapidly evolving military needs—leading to significant
fr_fr: ministères. Les consultations auprès de l'industrie prennent beaucoup de temps, et le processus est

source: delays in delivering critical equipment.
fr_fr: retards importants dans la fourniture de matériel indispensable.

source: To protect our sovereignty and bolster our industrial
fr_fr: Afin de protéger notre souveraineté

source: capacity, the government announced the creation of a new Defence Investment Agency
fr_fr: et de renforcer notre capacité industrielle, le gouvernement a annoncé la mise sur pied de la

source: (DIA) , which will overhaul and streamline Canada's defence procurement.
fr_fr: nouvelle Agence de l'investissement pour la défense , qui réorganisera et

source: The DIA will
fr_fr: L'Agence approuvera

source: approve procurements to support strategic defence sectors in Canada, so that we are able to ensure
fr_fr: les achats qui soutiennent des secteurs stratégiques de la défense au Canada pour garantir que les

source: the Canadian Armed Forces has the world-class equipment it needs, and at the same time create new
fr_fr: créer de nouveaux emplois, fera croître notre économie et appuiera l'innovation dans les domaines de

source: careers, grow our economy, and support innovation in aerospace, shipbuilding, and advanced
fr_fr: l'aérospatiale, de la construction navale et de la fabrication de pointe.

source: manufacturing. The Defence Investment Agency will have three objectives:
fr_fr: L' Agence de l'investissement pour la défense poursuivra trois objectifs :

source: Consolidate procurement processes —removing duplicative approvals and red tape,
fr_fr: Centraliser les processus d'approvisionnement , en éliminant les approbations

source: accelerating defence procurement, and providing industry with greater clarity and certainty.
fr_fr: redondantes et les formalités administratives, en accélérant les acquisitions dans le domaine de

source: With a centralised process of review and approval, procurements will advance faster.
fr_fr: la défense et en offrant à l'industrie plus de clarté et de certitude.

source: Target procurements to support strategic defence sectors in Canada, so that we
fr_fr: Grâce à un système

source: are able to meet the capability needs of the Canadian Armed Forces, and at the same time create
fr_fr: centralisé d'examen et d'approbation, les processus d'approvisionnement pourront progresser plus

source: new careers, grow our economy, and supercharge innovation in aerospace, shipbuilding, and
fr_fr: canadiennes, tout en créant de nouveaux emplois, en stimulant notre économie et en accélérant

source: advanced manufacturing.
fr_fr: de pointe.

source: Ensure earlier engagement between the Canadian Armed Forces and Canada's defence
fr_fr: Veiller à ce que les Forces armées canadiennes et l'industrie canadienne de la défense

source: industry , so the military can communicate operational needs, and industry can
fr_fr: collaborent dès le début des processus d'approvisionnement , afin que les

source: provide realistic assessments of timelines, costs, and technological options.
fr_fr: soit en mesure de fournir des évaluations réalistes des échéanciers, des coûts et des

source: Early engagement
fr_fr: différentes options technologiques.

source: will ensure both the government and industry can better anticipate future needs and build
fr_fr: gouvernement et à l'industrie de mieux anticiper les besoins et de renforcer les capacités

source: industrial capacity ahead of time, at speed and scale.
fr_fr: industrielles à l'avance, rapidement et à grande échelle.

source: Budget 2025 proposes to provide $30.8 million over four years,
fr_fr: Le budget de 2025 propose d'affecter 30,8 millions de dollars sur quatre ans, à

source: starting in 2026-27, with $7.7 million ongoing to Public Services and Procurement
fr_fr: compter de 2026-2027, et 7,7 millions de dollars par année par la suite, à Services

source: Canada to establish the DIA.
fr_fr: publics et Approvisionnement Canada pour la création de l'Agence de l'investissement pour la défense.

source: The DIA will accelerate the delivery of goods and services to
fr_fr: L'Agence accélérera la fourniture de produits et de services pour mieux répondre aux

source: better meet the needs of the CAF at the best value for Canadians by centralising processes
fr_fr: besoins des FAC d'une manière rentable pour les Canadiens, en centralisant les processus et en

source: and enhancing engagement and collaboration with Canadian industry and international
fr_fr: améliorant la concertation et la collaboration avec l'industrie canadienne et les partenaires

source: The Agency's focus will be on defence procurements valued at $100 million and
fr_fr: Elle se concentrera sur les marchés d'approvisionnement d'une valeur d'au moins

source: above, including submarines and other critical capabilities that the CAF requires.
fr_fr: 100 millions de dollars, ce qui englobe les sous-marins et les autres capacités

source: Budget 2025 proposes to provide $52.5 million over five years,
fr_fr: Le budget de 2025 propose de fournir 52,5 millions de dollars sur cinq ans, à compter

source: starting in 2026-27, with $12.2 million ongoing to Public Services and Procurement
fr_fr: de 2026-2027, et 12,2 millions de dollars par année par la suite à Services publics et

source: Canada to modernise and increase capacity for the Industrial Security
fr_fr: Approvisionnement Canada pour moderniser et accroître la capacité du Programme de

source: Program to meet the needs of the DIA and support Canada's defence industry.
fr_fr: pour la défense et de soutenir l'industrie de la défense canadienne.

source: Strengthening Canada's Presence: Operations REASSURANCE and AMARNA
fr_fr: Renforcer la présence du Canada : opérations REASSURANCE et AMARNA

source: Canada launched Operation REASSURANCE in 2014 following Russia's first invasion of Ukraine.
fr_fr: Le Canada a lancé en 2014 l'opération REASSURANCE, dans la foulée de la première invasion russe

source: More
fr_fr: en Ukraine.

source: than a decade later, it remains the CAF's largest overseas mission, with approximately 2,000 troops
fr_fr: FAC à l'étranger. En effet, environ 2 000 militaires canadiens sont actuellement déployés

source: currently deployed to deter Russian aggression and defend NATO territory.
fr_fr: dans le cadre de cette opération pour exercer un effet dissuasif contre toute agression russe et

source: Canada is strengthening transatlantic security and reaffirming our commitment to defend NATO
fr_fr: Le Canada renforce la sécurité transatlantique et réaffirme sa volonté de défendre le territoire de

source: territory in the face of ongoing Russian aggression.
fr_fr: l'OTAN face à l'agression russe qui persiste.

source: Under Operation REASSURANCE, Canada provides
fr_fr: Dans le cadre de l'opération REASSURANCE, le Canada

source: Armed Forces personnel to the Canadian-led NATO Multinational Brigade-Latvia (MNB-Latvia).
fr_fr: fournit du personnel des Forces armées canadiennes à la Brigade multinationale de l'OTAN en

source: In MNB-Latvia, Canada leads around 3,000 troops from 14 contributing nations.
fr_fr: Au sein de la Brigade multinationale en Lettonie, le Canada dirige environ 3 000 soldats provenant de 14 pays contributeurs.

source: The work of the
fr_fr: Le travail des Forces armées canadiennes permet de

source: Canadian Armed Forces strengthens NATO's defence of its Eastern Flank and contributes to deterrence
fr_fr: renforcer la défense du flanc est de l'OTAN et de contribuer aux efforts de dissuasion le long de la

source: efforts along Latvia's nearly 300 km border with Russia.
fr_fr: frontière de près de 300 km entre la Lettonie et la Russie.

source: In August 2025, the Prime Minister announced the renewal of Operation REASSURANCE for three
fr_fr: En août 2025, le premier ministre a annoncé le renouvellement de l'opération REASSURANCE pour

source: years, starting in 2026-27.
fr_fr: Ce renouvellement permettra de maintenir

source: This renewal will sustain the Brigade's personnel and military
fr_fr: les effectifs et les capacités militaires de la brigade en Lettonie et ainsi de renforcer notre

source: capabilities in Latvia—reinforcing our collective defence, strengthening co-operative security, and
fr_fr: défense collective et la coopération en matière de sécurité, tout en préservant la forte présence de

source: keeping NATO's presence strong on its Eastern Flank.
fr_fr: l'OTAN sur son flanc est.

source: Budget 2025 proposes to provide $2.7 billion over three years
fr_fr: Le budget de 2025 propose d'affecter 2,7 milliards de dollars sur trois ans selon la

source: on a cash basis, starting in 2026-27, to the Department of National Defence in support
fr_fr: comptabilité de caisse, à compter de 2026-2027, au ministère de la Défense nationale (MDN)

source: of the renewal of Operation REASSURANCE.
fr_fr: pour appuyer le renouvellement de l'opération REASSURANCE.

source: Operation REASSURANCE will remain the CAF's largest
fr_fr: Celle-ci demeurera la plus importante

source: overseas mission.
fr_fr: mission des FAC à l'étranger.

source: This year, Canada also launched Operation AMARNA, the CAF's contribution to strengthening peace and
fr_fr: Cette année, le Canada a également lancé l'opération AMARNA, qui représente la contribution des FAC

source: security in the Middle East.
fr_fr: au renforcement de la sécurité et de la paix au Moyen-Orient.

source: Operation AMARNA allows the CAF to adapt to changing geopolitical
fr_fr: Cette opération permet aux FAC de

source: dynamics and respond to emerging security challenges in the region.
fr_fr: s'adapter à l'évolution de la dynamique géopolitique et de réagir à toute menace pour la sécurité

source: Budget 2025 proposes to provide $300.1 million over three
fr_fr: Le budget de 2025 propose d'affecter une somme de 300,1 millions de dollars sur

source: years on a cash basis, starting in 2025-26, to the Department of National Defence and
fr_fr: trois ans selon la comptabilité de caisse, à compter de 2025-2026, au MDN et au Centre de

source: the Communications Security Establishment to support Operation AMARNA.
fr_fr: la sécurité des télécommunications pour appuyer l'opération AMARNA.

source: This will be partly
fr_fr: Cette somme sera compensée

source: offset by $155.8 million over three years of existing Department of National Defence
fr_fr: en partie par un montant de 155,8 millions de dollars sur trois ans provenant de

source: resources.
fr_fr: ressources existantes du MDN.

source: Investing Where It Counts: Defence Investments to Drive Economic Growth
fr_fr: Investir là où ça compte : des investissements dans la défense qui font

source: Defence spending is about more than just security—it also has the potential to catalyse
fr_fr: croître l'économie Les dépenses de défense ne concernent pas seulement la sécurité : elles peuvent

source: economic growth and innovation and strengthen long-term prosperity for Canadians in the
fr_fr: aussi exercer un effet catalyseur sur la croissance économique et l'innovation, tout

source: defence sector and beyond.
fr_fr: et au-delà de celui-ci.

source: This is because defence spending entails investments in strategic
fr_fr: En effet, les dépenses de défense entraînent des

source: assets—including dual-use infrastructure, advanced technologies, and sovereign
fr_fr: investissements dans des ressources stratégiques, comme l'infrastructure à double

source: capabilities—that durably boost the economy's productive capacity.
fr_fr: usage, les technologies de pointe et les capacités souveraines, qui stimulent de

source: The initial research and development (R&D) initiatives outlined above—amounting to
fr_fr: Les premières initiatives de recherche et développement (R-D) décrites ci-dessus, qui

source: $2.3 billion over five years to support R&D in quantum computing, space, aerospace,
fr_fr: se montent à 2,3 milliards de dollars sur cinq ans et visent à appuyer la R-D

source: and other advanced technologies—could add as much as $6.1 billion to Canada's national
fr_fr: aérospatiales, pourraient injecter jusqu'à 6,1 milliards de dollars à long

source: income over the long term.
fr_fr: terme dans le revenu national.

source: This is on top of the benefit of defence investments in enhancing
fr_fr: des investissements faits dans la défense en vue de renforcer la résilience et la

source: Canada's national security and resilience.
fr_fr: sécurité nationale du Canada.

source: 4.2 Protecting Our Borders and Communities
fr_fr: 4.2 Protéger nos frontières et nos communautés

source: In a time of global uncertainty, Canada's new government is taking action to ensure it can adapt and
fr_fr: En ces temps d'incertitude à l'échelle mondiale, le nouveau gouvernement du Canada agit pour

source: respond to emerging threats to protect the safety and security of our communities.
fr_fr: s'adapter et réagir aux nouvelles menaces afin de garder nos communautés en toute sécurité.

source: Cross-border
fr_fr: Le

source: smuggling of illegal guns and drugs, including fentanyl and its precursor chemicals, and other
fr_fr: trafic transfrontalier d'armes à feu et de drogues illicites, notamment le fentanyl et ses produits

source: security threats put Canadian communities at risk.
fr_fr: chimiques précurseurs, et d'autres menaces planent sur la sécurité des communautés canadiennes. Le

source: Canada's response to these threats, including to
fr_fr: Canada prend des mesures fermes et dynamiques pour mieux faire face à ces menaces, y compris celles

source: organised crime groups and the illicit financing networks that underpin their criminal activity, is
fr_fr: liées aux groupes criminels organisés et aux réseaux de financement illicite qui sous-tendent leurs

source: robust and dynamic.
fr_fr: activités criminelles.

source: Canada's new government is hiring more new law enforcement personnel, investing in enhanced
fr_fr: Le nouveau gouvernement du Canada recrute davantage de personnel des forces de l'ordre, investit pour

source: investigative capacity, and is removing dangerous assault-style firearms from Canadian communities.
fr_fr: améliorer les capacités d'enquête et retire de la circulation les armes à feu de style arme d'assaut

source: The government is choosing to build stronger communities—where you feel secure in your home, safe in
fr_fr: qui sont dangereuses pour les communautés canadiennes. Le gouvernement choisit de bâtir des

source: your neighbourhood, and in control of your future.
fr_fr: communautés plus fortes, où les gens se sentent en sécurité chez eux et dans leur quartier et maîtres de leur avenir.

source: Strengthening Federal Law Enforcement
fr_fr: Renforcer les services policiers fédéraux

source: Tougher laws are only one part of safer communities—we also need the people and the resources to
fr_fr: Il faut également disposer du personnel et des ressources nécessaires pour les faire respecter.

source: enforce them.
fr_fr: Le

source: Canada's new government is investing in hiring more RCMP personnel to enforce our laws
fr_fr: nouveau gouvernement du Canada investit dans le recrutement de nouveaux agents de la GRC afin de

source: and protect our communities.
fr_fr: faire respecter nos lois et de protéger nos communautés.

source: This means we are increasing federal policing capacity across Canada to
fr_fr: les capacités de la Police fédérale partout au Canada afin de lutter contre la criminalité,

source: combat crime—including online fraud, money laundering, online child sexual exploitation, and
fr_fr: notamment la fraude en ligne, le blanchiment d'argent, l'exploitation sexuelle des enfants en ligne

source: organised criminal networks that threaten Canada's economic and national security.
fr_fr: et les réseaux criminels organisés qui menacent la sécurité économique et nationale du Canada.

source: As announced on October 16, 2025, Budget 2025 proposes to
fr_fr: Comme il a été annoncé le 16 octobre 2025, le budget de 2025 propose

source: provide $1.7 billion over four years, starting in 2026-27, with
fr_fr: d'affecter 1,7 milliard de dollars sur quatre ans, à compter de 2026-2027, avec

source: $591.9 million in 2030-31, $227.1 million in remaining amortisation, and
fr_fr: 591,9 millions de dollars en 2030-2031, 227,1 millions de dollars en

source: $500.3 million ongoing for the Royal Canadian Mounted Police (RCMP) to strengthen the
fr_fr: amortissement restant et 500,3 millions de dollars par année par la suite, à la GRC pour

source: organisation's response to a wide range of threats related to transnational organised crime,
fr_fr: qu'elle puisse mieux contrer un large éventail de menaces liées au crime organisé transnational,

source: financial crimes and money laundering, while enhancing its intelligence and national
fr_fr: aux crimes financiers et au blanchiment d'argent, tout en améliorant la qualité du renseignement

source: security capacity.
fr_fr: et en renforçant sa capacité en matière de sécurité nationale.

source: This would fulfill the government's commitment to hire 1,000 RCMP
fr_fr: ainsi sa promesse de recruter 1 000 agents supplémentaires au sein de la

source: personnel.
fr_fr: GRC .

source: As announced on October 16, 2025, Budget 2025 also proposes to
fr_fr: Comme il a été annoncé le 16 octobre 2025, le budget de 2025 propose aussi

source: provide $90.1 million over four years, starting in 2026-27, and $22 million
fr_fr: de fournir 90,1 millions de dollars sur quatre ans, à compter de 2026-2027, et

source: ongoing to the RCMP to increase the cadet recruitment allowance to $1,000 per week.
fr_fr: recrutement des cadets pour qu'elle passe à 1 000 $ par semaine.

source: will be partly offset by $20 million over four years, $9.8 million in 2030-31
fr_fr: compensée en partie par des revenus prévus de 20 millions de dollars sur quatre ans,

source: and $9.4 million ongoing in expected revenue from contract policing partners.
fr_fr: de 9,8 millions de dollars en 2030-2031 et de 9,4 millions de dollars

source: This will better attract and maintain qualified and diverse RCMP candidates.
fr_fr: Cela permettra d'attirer et de retenir davantage de candidats qualifiés et diversifiés au sein de la GRC.

source: Establishing a Financial Crimes Agency
fr_fr: Établir l'Agence canadienne des crimes financiers

source: Criminals continue to exploit Canada's economy and financial system to commit sophisticated financial
fr_fr: Les criminels continuent d'exploiter l'économie et le système financier du pays pour commettre des

source: crimes, such as financial fraud, and to launder their illicit proceeds.
fr_fr: crimes financiers sophistiqués, tels que la fraude financière, et pour blanchir leurs produits

source: To combat these serious
fr_fr: illicites.

source: crimes and protect Canadians, Canada must take bold action, modeled after international best
fr_fr: Afin de lutter contre ces crimes graves et de protéger les Canadiens, le Canada doit

source: practices.
fr_fr: prendre des mesures audacieuses, inspirées de pratiques exemplaires internationales.

source: As announced on October 20, 2025, Budget 2025 will leverage
fr_fr: Comme il a été annoncé le 20 octobre 2025, le budget de 2025 tirera parti

source: investments in federal law enforcement capacity outlined above, to establish a new Financial Crimes Agency to be Canada's lead enforcement agency against
fr_fr: des investissements dans les capacités fédérales d'application de la loi décrits ci-dessus pour créer la nouvelle Agence canadienne des crimes financiers , qui sera le

source: financial crimes.
fr_fr: Cette agence sera un modèle

source: This agency will be a best-in-class model that aims to unite the police
fr_fr: d'excellence et visera à réunir l'expertise policière et l'expertise civile requises pour

source: and civilian expertise needed to investigate complex cases of money laundering, organised
fr_fr: enquêter sur des cas complexes de blanchiment d'argent, d'activités criminelles organisées et de

source: criminal activity, and online financial scams, and to recover illicit proceeds.
fr_fr: fraude financière en ligne, et récupérer les produits illicites qui en découlent.

source: The Minister of Finance and National Revenue will work with the
fr_fr: Le ministre des Finances et du Revenu national travaillera avec les ministres de la Justice et

source: Ministers of Justice and Public Safety to introduce legislation to stand up this agency by
fr_fr: de la Sécurité publique pour présenter un projet de loi visant à mettre sur pied cette agence

source: Spring of 2026.
fr_fr: d'ici le printemps 2026.

source: Enhancing the Canada Border Services Agency
fr_fr: Renforcer l'Agence des services frontaliers du Canada

source: As announced on October 17, 2025, Budget 2025 proposes to
fr_fr: Selon l'annonce du 17 octobre 2025, le budget de 2025 propose d'affecter

source: provide $617.7 million over five years, starting in 2025-26, with
fr_fr: 617,7 millions de dollars sur cinq ans, à compter de 2025-2026, avec

source: $51.3 million in remaining amortisation and $198.3 million ongoing for the Canada
fr_fr: 51,3 millions de dollars en amortissement restant et 198,3 millions de dollars par

source: Border Services Agency (CBSA) to increase its capacity to detect and intercept illicit
fr_fr: à renforcer la capacité de l'ASFC de détecter et d'intercepter des produits illicites, ainsi que

source: goods, and defend Canadian industries by enforcing import measures and bolstering its trade
fr_fr: d'appliquer les mesures à l'importation et les règles en matière de recours commerciaux pour

source: remedy capacity.
fr_fr: mieux défendre les industries canadiennes.

source: Budget 2025 will also increase the CBSA's recruit
fr_fr: Le budget de 2025 permettra aussi d'augmenter

source: stipend from $125 to $525 per week.
fr_fr: l'indemnité versée aux recrues de l'ASFC de 125 $ à 525 $ par semaine.

source: As also announced on October 17, 2025, Budget 2025 proposes to
fr_fr: Comme il a aussi été annoncé le 17 octobre 2025, le budget de 2025 propose

source: amend the Public Service Superannuation Act to extend the operational service early
fr_fr: de modifier la Loi sur la pension de la fonction publique afin d'élargir le programme

source: retirement program to frontline CBSA officers and other eligible frontline employee groups
fr_fr: de retraite anticipée du service opérationnel aux agents de première ligne de l'ASFC et à

source: in the Public Service Pension Plan, so that they receive pension benefits that reflect the
fr_fr: d'autres groupes d'employés de première ligne admissibles au Régime de retraite de la fonction

source: weight of their responsibilities, at a cost of $216.8 million over five years, starting
fr_fr: responsabilités, pour un montant de 216,8 millions de dollars sur cinq ans, à compter

source: in 2025-26, and $10.8 million ongoing.
fr_fr: de 2025-2026, et de 10,8 millions de dollars par année par la suite.

source: This funding is complementary to the $1.3 billion Border Plan announced in
fr_fr: Ce financement s'ajoute au montant de 1,3 milliard de dollars consacré au Plan frontalier

source: December 2024, which together will allow the CBSA to hire up to 1,000 new officers.
fr_fr: annoncé en décembre 2024; ces sommes permettront collectivement à l'ASFC d'embaucher

source: Canada Community Security Program
fr_fr: Programme pour la sécurité communautaire du Canada
